# ConstructionName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisConstruction..::..ConstructionName Property
EnergyAnalysisConstruction Class See Also
---
The name of the construction
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public string ConstructionName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ConstructionName As String
	Get
```

Visual C++
---
```text
public:
property String^ ConstructionName {
	String^ get ();
}
```

# See Also
EnergyAnalysisConstruction Class
Autodesk.Revit.DB.Analysis Namespace